import styles from './page.module.css';

export default function Page() {
  return (
    <div>
      <div className={styles.pageContainer}>
        <p>
          Данное соглашение об использовании персональных данных (далее Соглашение) распространяется
          на ИП Александрова Татьяна Ивановна (далее Исполнитель) и на пользователей сайта
          https://teplohranitel-avto.ru/ (далее Заказчик).
        </p>

        <p>
          Заказывая услуги у Исполнителя и/или пользуясь любыми сервисами сайта
          https://teplohranitel-avto.ru/ Вы подтверждаете, что ознакомились с Соглашением и согласны
          с его пунктами, и выражаете свое согласие предоставить Исполнителю и/или доверенным лицам
          Исполнителя персональные данные о себе. Если Вы не согласны с одним или несколькими
          пунктами Соглашения, или не согласны предоставить персональные данные о себе Исполнителю
          и/или доверенным лицам Исполнителя, пожалуйста, откажитесь от услуг Исполнителя и/или от
          продолжения работы с сайтом.
        </p>

        <p>1. Персональные данные, которые собирает, хранит и обрабатывает Исполнитель.</p>

        <p>
          1.1. Для полноценного предоставления услуг Заказчику, Исполнитель собирает, хранит и
          обрабатывает персональные данные Заказчика.
        </p>

        <p>
          1.2. В число персональных данных, которые собирает, хранит и обрабатывает Исполнитель,
          входит:
        </p>

        <p>1.2.1. Имя, фамилия, номер телефона (в том числе и мобильного);</p>

        <p>
          1.2.2. Данные, которые автоматически передаются в сеть с устройства Заказчика: IP-адрес,
          информация из файлов cookie (т.н. куки), информация о браузере или иной программе, с
          помощью которых Заказчик осуществляет доступ в сеть и к конкретному сайту, дата и время
          доступа, адрес запрашиваемой страницы.
        </p>

        <p>
          1.2.3. Другие сведения о Заказчике, которые Исполнитель обоснованно может отнести к
          персональным данным.
        </p>

        <p>2. Для каких целей использует Исполнитель персональные данные Заказчика.</p>

        <p>
          2.1. В рамках данного Соглашения персональные данные Заказчика могут быть использованы в
          следующих целях:
        </p>

        <p>
          а. Для предоставления Заказчику информации об используемом Заказчиком оборудовании, услуг
          и сервиса, а также для предоставления информации о товарах и услугах, которые, по мнению
          Исполнителя, могут представлять интерес для Заказчика;
        </p>

        <p>б. Для доставки заказанных/согласованных товаров и оказания других услуг Заказчику;</p>

        <p>
          в. Для информирования Заказчика о новых услугах или товарах Исполнителя и/или партнеров
          Исполнителя. Заказчик может быть информирован с помощью различных средств связи, включая,
          но не ограничиваясь перечисленным: почтовая рассылка, электронная почта, телефон (в том
          числе мобильный телефон), факсимильная связь, сеть интернет;
        </p>

        <p>г. Для защиты интересов Исполнителя;</p>

        <p>
          д. Для других законных целей, направленных на усовершенствование качества предоставляемых
          услуг и продуктов Исполнителя.
        </p>

        <p>3. Предоставление персональных данных Заказчика третьим лицам.</p>

        <p>
          3.1. За исключением случаев, предусмотренных законодательством и настоящим Соглашением,
          Исполнитель обязуется без прямого согласия Заказчика не продавать, не предоставлять в
          пользование, не обменивать и никаким иным образом не передавать третьим лицам персональные
          данные Заказчика.
        </p>

        <p>
          3.2. Исполнитель имеет право предоставить третьим лицам персональные данные Заказчика,
          если:
        </p>

        <p>
          3.2.1 Заказчик дал свое прямое согласие на передачу своих персональных данных третьим
          лицам.
        </p>

        <p>
          3.2.2. Передача персональных данных Заказчика необходима для оказания услуг Заказчику
          и/или для обработки персональных данных Заказчика. В случае, когда Исполнитель передает
          персональные данные Заказчика третьим лицам, Исполнитель требует от третьих лиц соблюдение
          конфиденциальности персональных данных Заказчика.
        </p>

        <p>3.2.3. Передача, использование или раскрытие такой информации необходимы для:</p>

        <p>а. соблюдения любых действующих законов и нормативных актов;</p>

        <p>б. решения и/или устранения возникших технических проблем;</p>

        <p>в. защиты интересов Исполнителя.</p>

        <p>
          3.3. В случае, если Исполнителем будет осуществлена полная или частичная продажа, или иная
          передача своих активов, к получателю активов перейдут все обязательства по сохранению
          конфиденциальности персональных данных Заказчика, предусмотренные данным Соглашением.
        </p>

        <p>4. Защита персональных данных Заказчика.</p>

        <p>
          4.1. Исполнитель принимает все необходимые меры для защиты персональных данных Заказчика.
          Однако на Заказчике лежит вся ответственность за обеспечение безопасности устройств, через
          которые Заказчик осуществляют выход в сети Интернет, и информации, хранящейся на этих
          устройствах.
        </p>

        <p>4.2. Заказчик подтверждает и соглашается с тем, что он лично отвечает:</p>

        <p>
          4.2.1. За обеспечение безопасности устройства (персональный компьютер, мобильное
          устройство и т.д.), через которое Заказчик осуществляет выход в сети Интернет;
        </p>

        <p>5. Согласие Заказчика на добровольное предоставление персональных данных Исполнителю.</p>

        <p>
          5.1. Заказывая услуги Исполнителя и/или используя сервисы сайта
          https://teplohranitel-avto.ru/ Заказчик в явной форме выражает свое согласие предоставить
          Исполнителю и доверенным лицам Исполнителя свои персональные данные для сохранения,
          последующей обработки и использования этих данных.
        </p>

        <p>5.2. Заказчик обязан поддерживать персональные данные о себе в актуальном состоянии.</p>

        <p>
          5.3. Заказчик может в любой момент прервать настоящее Соглашение, о чем обязан уведомить
          Исполнителя за 14 дней.
        </p>

        <p>
          5.3.1. Заказчик может направить Исполнителю уведомление о прерывании Соглашения заказным
          почтовым уведомлением с описью вложения или вручить уведомление лично под роспись
          уполномоченному представителю Исполнителя.
        </p>
      </div>
    </div>
  );
}
