
export const metadata = {
  title: 'Зимний портативный гараж - магазин теплохранитель авто',
  description: 'Купите зимний портативный гараж для надежной защиты вашего автомобиля от снега и холода. Удобные и практичные решения для хранения в Чите. Доставка. Теплохранитель авто. ',
  keywords: ['зимний гараж', 'зимний гараж в Чите','портативный гараж', 'портативный гараж в Чите', 'гараж для зимы', 'складной гараж', 'тёплый гараж', 'тёплый чехол', 'чехол для автомобиля', 'зимний чехол', 'складной гараж','Теплохранитель авто']

}

export default function Layout({ children }) {
  return children
}